let runes = [
    { "no": 1, "name": "艾尔" },
    { "no": 2, "name": "艾德" },
    { "no": 3, "name": "特尔" },
    { "no": 4, "name": "那夫" },
    { "no": 5, "name": "爱斯" },
    { "no": 6, "name": "伊斯" },
    { "no": 7, "name": "塔尔" },
    { "no": 8, "name": "拉尔" },
    { "no": 9, "name": "欧特" },
    { "no": 10, "name": "书尔" },
    { "no": 11, "name": "安姆" },
    { "no": 12, "name": "索尔" },
    { "no": 13, "name": "夏" },
    { "no": 14, "name": "多尔" },
    { "no": 15, "name": "海尔" },
    { "no": 16, "name": "破" },
    { "no": 17, "name": "鲁姆" },
    { "no": 18, "name": "科" },
    { "no": 19, "name": "法尔" },
    { "no": 20, "name": "蓝姆" },
    { "no": 21, "name": "普尔" },
    { "no": 22, "name": "乌姆" },
    { "no": 23, "name": "马尔" },
    { "no": 24, "name": "伊斯特" },
    { "no": 25, "name": "古尔" },
    { "no": 26, "name": "维克斯" },
    { "no": 27, "name": "欧姆" },
    { "no": 28, "name": "罗" },
    { "no": 29, "name": "瑟" },
    { "no": 30, "name": "贝" },
    { "no": 31, "name": "乔" },
    { "no": 32, "name": "查姆" },
    { "no": 33, "name": "萨德" },
];

let rgeneral =
    [
        {
            "name": "远古誓言",
            "name2": "Ancient’s Pledge",
            "eqip": [
                "盾牌"
            ],
            "slotnum": 3,
            "rns": [
                8,
                9,
                7
            ],
            "ll": 21,
            "desp": "+50% 增强防御|抗寒 +43%|抗毒 +48%|抗火 +48%|抗闪电 +48%|10% 受损的生命转化成法力的提高"
        },
        {
            "name": "黑色",
            "name2": "Black",
            "eqip": [
                "棍棒",
                "铁锤",
                "钉头锤"
            ],
            "slotnum": 3,
            "rns": [
                10,
                16,
                4
            ],
            "ll": 35,
            "desp": "+120% 增强伤害|40% 概率出现压碎性打击|+200 攻击准确率|+3-14 冰伤害，效果持续 3 秒|+10 体力|15% 提升攻击速度|击退|法术伤害减少 2|4级尸体爆炸 (12 次)"
        },
        {
            "name": "狂暴 ",
            "name2": "Fury",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 3,
            "rns": [
                31,
                25,
                5
            ],
            "ll": 65,
            "desp": "+209% 增强伤害|40% 提升攻击速度|防止怪物自疗|66% 概率撕开敌人伤口|33% 概率出现致命打击|忽略目标防御|-25% 目标防御|20% 提升攻击准确率|每次击中偷取 6% 生命|+5级狂乱 (限野蛮人使用)"
        },
        {
            "name": "圣雷",
            "name2": "Holy Thunder",
            "eqip": [
                "权杖"
            ],
            "slotnum": 4,
            "rns": [
                5,
                8,
                9,
                7
            ],
            "ll": 21,
            "desp": "+60% 增强伤害|-25% 目标防御|+5-30 火伤害|+21-110 电伤害|+75 毒伤害，效果持续 5 秒|+10 最大伤害|抗闪电 +60%|+5% 抗闪电上限|+3级圣神冲击 (限圣骑士使用)|7级连锁闪电 (60 次)"
        },
        {
            "name": "荣耀",
            "name2": "Honor",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 5,
            "rns": [
                11,
                1,
                6,
                3,
                12
            ],
            "ll": 27,
            "desp": "+160% 增强伤害|+9 最小伤害|+9 最大伤害|25% 概率出现致命打击|+250 攻击准确率|+1 所有技能|每次击中偷取 7% 生命|自动恢复生命 +10|+10 力量|+1 照亮范围|+2 点法力在杀死每个敌人时获得"
        },
        {
            "name": "国王之恩典",
            "name2": "King’s Grace",
            "eqip": [
                "刀剑",
                "权杖"
            ],
            "slotnum": 3,
            "rns": [
                11,
                8,
                10
            ],
            "ll": 25,
            "desp": "+100% 增强伤害|+100% 对恶魔的伤害|+50% 对不死生物的伤害|+ 5-30 火伤害|+3-14 冰伤害，效果持续 3 秒|+150 攻击准确率|+100 对抗恶魔的攻击准确率|+100 对抗不死生物的攻击准确率|每次击中偷取 7% 生命"
        },
        {
            "name": "叶",
            "name2": "Leaf",
            "eqip": [
                "法杖"
            ],
            "slotnum": 2,
            "rns": [
                3,
                8
            ],
            "ll": 19,
            "desp": "+5-30 火伤害|+3 级火系技能|+3级火弹 (限法师使用)|+3级地狱火 (限法师使用)|+3级温暖 (限法师使用)|+2 点法力在杀死每个敌人时获得|抗寒 +33%|+(每角色等级 2) 2-198 防御"
        },
        {
            "name": "狮心",
            "name2": "Lionheart",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                15,
                17,
                19
            ],
            "ll": 41,
            "desp": "+20% 增强伤害|需求 -15%|+25 力量|+10 能量|+20 体力|+15 敏捷|+50 生命|所有抗性 +30"
        },
        {
            "name": "知识",
            "name2": "Lore",
            "eqip": [
                "头盔"
            ],
            "slotnum": 2,
            "rns": [
                9,
                12
            ],
            "ll": 27,
            "desp": " +1 所有技能|+10 能量|+2 点法力在杀死每个敌人时获得|抗闪电 +30%|物理伤害减少 7|+2 照亮范围"
        },
        {
            "name": "怨恨",
            "name2": "Malice",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 3,
            "rns": [
                6,
                1,
                5
            ],
            "ll": 15,
            "desp": "+33% 增强伤害|+9 最大伤害|100% 概率撕开敌人伤口|-25% 目标防御|每次击中 -100 怪物防御力|防止怪物自疗|+50 攻击准确率|失血 -5"
        },
        {
            "name": "优雅旋律",
            "name2": "Melody",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 3,
            "rns": [
                13,
                18,
                4
            ],
            "ll": 39,
            "desp": "+50% 增强伤害|+300% 对不死生物的伤害|+3级弓和十字弓技能 (限亚马逊使用)|+3级双倍打击 (限亚马逊使用)|+3级闪避 (限亚马逊使用)|+3级慢速箭 (限亚马逊使用)|20% 提升攻击速度|+10 敏捷|击退"
        },
        {
            "name": "回忆",
            "name2": "Memory",
            "eqip": [
                "法杖"
            ],
            "slotnum": 4,
            "rns": [
                17,
                16,
                12,
                5
            ],
            "ll": 37,
            "desp": "+3 法师技能等级|33% 快速施法速度|提升法力上限 20%|+3级能量护盾 (限法师使用)|+2级静电力场 (限法师使用)|+10 能量|+10 体力|+9 最小伤害|-25% 目标防御力|法术伤害减少 7|+50% 增强防御"
        },
        {
            "name": "天底",
            "name2": "Nadir",
            "eqip": [
                "头盔"
            ],
            "slotnum": 2,
            "rns": [
                4,
                3
            ],
            "ll": 13,
            "desp": "+50% 增强防御|+10 防御|+30 对远程攻击的防御|13 级的 魔影斗篷 (9 次)|+2 点法力在杀死每个敌人时获得|+5 力量|-33% 额外金币从怪物身上取得|-3 照亮范围"
        },
        {
            "name": "光辉",
            "name2": "Radiance",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                4,
                12,
                6
            ],
            "ll": 27,
            "desp": "+75% 增强防御|+30 对远程攻击的防御|+10 能量|+10 体力|15% 受损的生命转化成法力的提高|法术伤害减少 3|+33 法力|物理伤害减少 7|+5 照亮范围"
        },
        {
            "name": "韵律",
            "name2": "Rhyme",
            "eqip": [
                "盾牌"
            ],
            "slotnum": 2,
            "rns": [
                13,
                5
            ],
            "ll": 29,
            "desp": "+20% 格挡成功率|+40% 快速格挡速度|所有抗性 +25|提升法力恢复速度 15%|不被冰冻|50% 额外金币从怪物身上取得|25% 更佳的机会取得魔法装备"
        },
        {
            "name": "寂静",
            "name2": "Silence",
            "eqip": [
                "武器"
            ],
            "slotnum": 6,
            "rns": [
                14,
                2,
                15,
                24,
                3,
                26
            ],
            "ll": 55,
            "desp": "+200% 增强伤害|+75% 对不死生物的伤害|需求 -20%|20% 提升攻击速度|+50 对抗不死生物的攻击准确率|+2 所有技能|所有抗性 +75|20% 快速打击恢复|每次击中偷取 11% 法力|击中后吓跑怪物概率 25%|击中使目标目盲 +33|+2 点法力在杀死每个敌人时获得|30% 更佳的机会取得魔法装备"
        },
        {
            "name": "烟尘",
            "name2": "Smoke",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 2,
            "rns": [
                4,
                17
            ],
            "ll": 37,
            "desp": "+75% 增强防御|+280 对远程攻击的防御|所有抗性 +50|20% 快速打击恢复|6级削弱 (18 次)|+10 能量|-1 照亮范围"
        },
        {
            "name": "潜行",
            "name2": "Stealth",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 2,
            "rns": [
                7,
                5
            ],
            "ll": 17,
            "desp": "法术伤害减少 3|+6 敏捷|+15 体力上限|抗毒 +30%|提升法力恢复速度 15%|25% 快速移动/奔跑|25% 快速施法速度|25% 快速打击恢复"
        },
        {
            "name": "钢铁",
            "name2": "Steel",
            "eqip": [
                "刀剑",
                "斧头",
                "钉头锤"
            ],
            "slotnum": 2,
            "rns": [
                3,
                1
            ],
            "ll": 13,
            "desp": "+20% 增强伤害|+3 最小伤害|+3 最大伤害|+50 攻击准确率|50% 概率撕开敌人伤口|25% 提升攻击速度|+2 点法力在杀死每个敌人时获得|+1 照亮范围"
        },
        {
            "name": "力量",
            "name2": "Strength",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 2,
            "rns": [
                11,
                3
            ],
            "ll": 25,
            "desp": "+35% 增强伤害|25% 概率出现压碎性打击|每次击中偷取 7% 生命|+2 点法力在杀死每个敌人时获得|+20 力量|+10 体力 "
        },
        {
            "name": "毒液",
            "name2": "Venom",
            "eqip": [
                "武器"
            ],
            "slotnum": 3,
            "rns": [
                3,
                14,
                23
            ],
            "ll": 49,
            "desp": "击中后吓跑怪物概率 25%|防止怪物自疗|忽略目标防御|每次击中偷取 7% 法力|15级毒爆 (27 次)|13级剧毒新星 (11 次)|+273 毒伤害,效果持续 6 秒"
        },
        {
            "name": "财富",
            "name2": "Wealth",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                20,
                18,
                3
            ],
            "ll": 43,
            "desp": "300% 额外金币从怪物身上取得|100% 更佳的机会取得魔法装备|+2 点法力在杀死每个敌人时获得|+10 敏捷"
        },
        {
            "name": "白色",
            "name2": "White",
            "eqip": [
                "手杖"
            ],
            "slotnum": 2,
            "rns": [
                14,
                16
            ],
            "ll": 35,
            "desp": "击中后吓跑怪物概率 25%|+10 体力|+3级毒素和白骨法术 (限死灵法师使用)|+3级白骨装甲 (限死灵法师使用)|+2级骨矛 (限死灵法师使用)|+4级支配骷髅 (限死灵法师使用)|法术伤害减少 4|20% 快速施法速度|+13 法力"
        },
        {
            "name": "和风",
            "name2": "Zephyr",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 2,
            "rns": [
                9,
                5
            ],
            "ll": 21,
            "desp": "+33% 增强伤害|+66 攻击准确率|+1-50 电伤害|-25% 目标防御力|+25 防御|25% 快速移动/奔跑|25% 提升攻击速度|7% 概率当被击中时施放出1级小旋风"
        }
    ]

let r110 =
    [
        {
            "name": "野兽",
            "name2": "Beast",
            "eqip": [
                "斧头",
                "权杖",
                "锤类"
            ],
            "slotnum": 5,
            "rns": [
                30,
                3,
                22,
                23,
                17
            ],
            "ll": 63,
            "desp": "在装备后拥有9级狂热灵气|40% 提升攻击速度|+240-270% 增强伤害|20% 概率出现压碎性打击|25% 概率撕开敌人伤口|+3级熊人变化|+3级变形术|防止怪物自疗|+25-40 力量|+10 能量|+2 点法力在杀死每个敌人时获得|13级召唤灰熊 (5 次)"
        },
        {
            "name": "荆棘",
            "name2": "Bramble",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 4,
            "rns": [
                8,
                27,
                29,
                5
            ],
            "ll": 61,
            "desp": "装备后拥有15-21级荆棘灵气|50% 快速打击恢复|+25-50% 毒技能伤害|+300 防御|提升法力上限 5%|提升法力恢复速度 15%|+5% 抗寒上限|抗火 +30%|抗毒 +100%|+13 点生命在杀死每个敌人时获得|13级棘灵 (33 次)"
        },
        {
            "name": "死亡呼吸",
            "name2": "Breath of the Dying",
            "eqip": [
                "武器"
            ],
            "slotnum": 6,
            "rns": [
                26,
                15,
                1,
                2,
                33,
                5
            ],
            "ll": 69,
            "desp": "50% 概率当你杀死敌人时施放出20级剧毒新星|无法破坏|60% 提升攻击速度|+350-400% 增强伤害|+200% 对不死生物的伤害|-25% 目标防御|+50 攻击准确率|+50 对抗不死生物的攻击准确率|每次击中偷取 7% 法力|每次击中偷取 12-15% 生命|防止怪物自疗|+30 所有属性|+1 照亮范围|需求 -20%"
        },
        {
            "name": "战争召唤",
            "name2": "Call To Arms",
            "eqip": [
                "武器"
            ],
            "slotnum": 5,
            "rns": [
                11,
                8,
                23,
                24,
                27
            ],
            "ll": 57,
            "desp": "+1 所有技能|+40% 提升攻击速度|+250-290% 增强伤害|+5-30 火伤害|每次击中偷取 7% 生命|+2-6级战斗指挥|+1-6级战斗体制|+1-4级战嗥|防止怪物自疗|自动恢复生命 +12|30% 更佳的机会取得魔法装备"
        },
        {
            "name": "荣耀之链",
            "name2": "Chains of Honor",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 4,
            "rns": [
                14,
                22,
                30,
                24
            ],
            "ll": 63,
            "desp": "+2 所有技能|+200% 对恶魔的伤害|+100% 对不死生物的伤害|每次击中偷取 8% 生命|70% 提升防御力|+20 力量|自动恢复生命 +7|所有抗性 +65|物理伤害减少 8%|25% 更佳的机会取得魔法装备"
        },
        {
            "name": "混沌",
            "name2": "Chaos",
            "eqip": [
                "爪类"
            ],
            "slotnum": 3,
            "rns": [
                19,
                27,
                22
            ],
            "ll": 57,
            "desp": "9% 概率在击中目标时施放出11级冰封球|11% 概率在击中目标时施放出9级充能弹|35% 提升攻击速度|+290-340% 增强伤害|+216-471 魔法伤害|25% 概率撕开敌人伤口|+1级旋风|+10 力量|+15 点生命在杀死每个敌人时获得"
        },
        {
            "name": "新月",
            "name2": "Crescent Moon",
            "eqip": [
                "斧头",
                "刀剑",
                "长柄武器"
            ],
            "slotnum": 3,
            "rns": [
                13,
                22,
                3
            ],
            "ll": 47,
            "desp": "10% 概率在击中目标时施放出17级连锁闪电|7% 概率在击中目标时施放出13级静电力场|20% 提升攻击速度|+180-220% 增强伤害|忽略目标防御|-35% 敌人的闪电系抗性|25% 概率撕开敌人伤口|+9-11 魔法吸收|+2 点法力在杀死每个敌人时获得|18级召唤狼灵 (30 次)"
        },
        {
            "name": "迪勒瑞姆",
            "name2": "Delirium",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                20,
                24,
                16
            ],
            "ll": 51,
            "desp": "1% 概率当被击中时施放出50级迪勒瑞姆(stun)|6% 概率当被击中时施放出14级心灵爆震|14% 概率当被击中时施放出13级恐惧|11% 概率在击中目标时施放出18级迷乱|+2 所有技能|+261 防御|+10 体力|50% 额外金币从怪物身上取得|25% 更佳的机会取得魔法装备|17级吸引 (60 次)"
        },
        {
            "name": "末日",
            "name2": "Doom",
            "eqip": [
                "斧头",
                "长柄武器",
                "锤类"
            ],
            "slotnum": 5,
            "rns": [
                15,
                27,
                22,
                28,
                32
            ],
            "ll": 67,
            "desp": "5% 概率在击中目标时施放出18级火山|当装备时拥有12级神圣冰冻灵气|+2 所有技能|45% 提升攻击速度|+330-370% 增强伤害|-40-60% 敌人抗寒|20% 概率出现致命打击|25% 概率撕开敌人伤口|防止怪物自疗|冰冻目标 +3|需求 -20%"
        },
        {
            "name": "强制",
            "name2": "Duress",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                13,
                22,
                10
            ],
            "ll": 47,
            "desp": "40% 快速打击恢复|+10-20% 增强伤害|+37-133 冰伤害|15% 概率出现压碎性打击|33% 概率撕开敌人伤口|+150-200% 增强防御|-20% 减慢体力耗损|抗寒 +45%|抗闪电 +15%|抗火 +15%|抗毒 +15%"
        },
        {
            "name": "谜团",
            "name2": "Enigma",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                31,
                6,
                30
            ],
            "ll": 65,
            "desp": "+2 所有技能|45% 快速移动/奔跑|+1级传送|+750-775 防御|+(0.75 每角色等级) +0-74 力量|提升生命上限 5%|物理伤害减少 8%|+14 点生命在杀死每个敌人时获得|15% 受损的生命转化成法力的提高|+(1 每角色等级) +1-99% 魔法装备出现概率"
        },
        {
            "name": "永恒",
            "name2": "Eternity",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 5,
            "rns": [
                11,
                30,
                24,
                12,
                29
            ],
            "ll": 63,
            "desp": "无法破坏|+260-310% 增强伤害|+9 最小伤害|每次击中偷取 7% 生命|20% 概率出现压碎性打击|击中使目标目盲|减慢目标速度 33%|提升法力恢复速度 16%|自动恢复生命 +16|不被冰冻|30% 更佳的机会取得魔法装备|8级重生 (88 次)"
        },
        {
            "name": "流亡",
            "name2": "Exile",
            "eqip": [
                "圣骑士盾牌"
            ],
            "slotnum": 4,
            "rns": [
                26,
                27,
                24,
                14
            ],
            "ll": 57,
            "desp": "15% 概率在击中目标时施放出5级偷取生命|当装备时拥有13-16级反抗灵气|+2级攻击性灵气 (限圣骑士使用)|+30% 快速格挡速度|冰冻目标|+220-260% 提升防御力|自动恢复生命 +7|+5% 抗寒上限|+5% 抗火上限|25% 更佳的机会取得魔法装备|每 4 秒恢复 1 耐久度"
        },
        {
            "name": "饥荒",
            "name2": "Famine",
            "eqip": [
                "斧头",
                "棍棒"
            ],
            "slotnum": 4,
            "rns": [
                19,
                27,
                9,
                31
            ],
            "ll": 65,
            "desp": "30% 提升攻击速度|+320-370% 增强伤害|忽略目标防御|+180-200 魔法伤害|+50-200 火伤害|+51-250 电伤害|+50-200 冰伤害|每次击中偷取 12% 生命|防止怪物自疗|+10 力量"
        },
        {
            "name": "幽暗",
            "name2": "Gloom",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                19,
                22,
                21
            ],
            "ll": 47,
            "desp": "15% 概率当被击中时施放出3级微暗灵视|10% 快速打击恢复|+200-260% 增强防御|+10 力量|所有抗性 +45|冰冻时间减半|5% 受损的生命转化成法力的提高|-3 照亮范围"
        },
        {
            "name": "正义之手",
            "name2": "Hand of Justice",
            "eqip": [
                "武器"
            ],
            "slotnum": 4,
            "rns": [
                29,
                32,
                11,
                28
            ],
            "ll": 67,
            "desp": "100% 概率当你升级时施放出36级炽烈之径|100% 概率当你死亡时施放出48级陨石|当装备时拥有16级圣火灵气|+33% 提升攻击速度|+280-330% 增强伤害|忽略目标防御|每次击中偷取 7% 生命|-20% 敌人的火焰系抗性|20% 概率出现致命打击|击中使目标目盲|冰冻目标 +3"
        },
        {
            "name": "橡树之心",
            "name2": "Heart of the Oak",
            "eqip": [
                "法杖",
                "钉头锤"
            ],
            "slotnum": 4,
            "rns": [
                18,
                26,
                21,
                10
            ],
            "ll": 55,
            "desp": "+3 所有技能|40% 快速施法速度|+75% 对恶魔的伤害|+100 对抗恶魔的攻击准确率|+3-14 冰伤害，效果持续 3 秒|每次击中偷取 7% 法力|+10 敏捷|自动恢复生命 +20|提升法力上限 15%|所有抗性 +30-40|4级橡木智者 (25 次)|14级乌鸦 (60 次)|+50% 对不死生物的伤害"
        },
        {
            "name": "弑君者",
            "name2": "Kingslayer",
            "eqip": [
                "刀剑",
                "斧头"
            ],
            "slotnum": 4,
            "rns": [
                23,
                22,
                25,
                19
            ],
            "ll": 53,
            "desp": "30% 提升攻击速度|+230-270% 增强伤害|-25% 目标防御|20% 提升攻击准确率|33% 概率出现致命打击|50% 概率撕开敌人伤口|+1级复仇|防止怪物自疗|+10 力量|40% 额外金币从怪物身上取得"
        },
        {
            "name": "热情",
            "name2": "Passion",
            "eqip": [
                "武器"
            ],
            "slotnum": 4,
            "rns": [
                14,
                9,
                2,
                20
            ],
            "ll": 43,
            "desp": "25% 提升攻击速度|+160-210% 增强伤害|50-80% 提升攻击准确率|+75% 对不死生物的伤害|+50 对抗不死生物的攻击准确率|+1-50 电伤害|+1级狂战士|+1级热诚|击中使目标目盲 +10|击中后吓跑怪物概率 25%|75% 额外金币从怪物身上取得|3级狼獾之心 (12 次)"
        },
        {
            "name": "慎重",
            "name2": "Prudence",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 2,
            "rns": [
                23,
                3
            ],
            "ll": 49,
            "desp": "25% 快速打击恢复|+140-170% 增强防御|所有抗性 +25-35|物理伤害减少 3|法术伤害减少 17|+2 点法力在杀死每个敌人时获得|+1 照亮范围|每 4 秒恢复 1 耐久度"
        },
        {
            "name": "圣堂",
            "name2": "Sanctuary",
            "eqip": [
                "盾牌"
            ],
            "slotnum": 3,
            "rns": [
                18,
                18,
                23
            ],
            "ll": 49,
            "desp": "20% 快速打击恢复|+20% 快速格挡速度|+20% 格挡成功率|+130-160% 增强防御|+250 对远程攻击的防御|+20 敏捷|所有抗性 +50-70|法术伤害减少 7|12级慢速箭 (60 次)"
        },
        {
            "name": "灿烂",
            "name2": "Splendor",
            "eqip": [
                "盾牌"
            ],
            "slotnum": 2,
            "rns": [
                5,
                17
            ],
            "ll": 37,
            "desp": "+1 所有技能|10% 快速施法速度|+20% 快速格挡速度|+60-100% 增强防御|+10 能量|提升法力恢复速度 15%|50% 额外金币从怪物身上取得|20% 更佳的机会取得魔法装备|+3 照亮范围|提升耐久度上限 12%"
        },
        {
            "name": "石块",
            "name2": "Stone",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 4,
            "rns": [
                13,
                22,
                21,
                17
            ],
            "ll": 47,
            "desp": "60% 快速打击恢复|+250-290% 增强防御|+300 对远程攻击的防御|+16 力量|+16 体力|+10 能量|所有抗性 +15|16级熔浆巨岩 (80 次)|16级黏土石魔 (16 次)"
        },
        {
            "name": "轻风",
            "name2": "Wind",
            "eqip": [
                "近战武器"
            ],
            "slotnum": 2,
            "rns": [
                29,
                1
            ],
            "ll": 61,
            "desp": "10% 概率在击中目标时施放出9级龙卷风|+20% 快速移动/奔跑|40% 提升攻击速度|15% 快速打击恢复|+120-160% 增强伤害|-50% 目标防御|+53 攻击准确率|击中使目标目盲|+1 照亮范围|13级小旋风 (127 次)"
        }
    ]

let r111 =
    [
        {
            "name": "骨头",
            "name2": "Bone",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                12,
                22,
                22
            ],
            "ll": 47,
            "desp": "15% 概率在击中目标时施放出10级骨矛|15% 概率当被击中时施放出10级白骨装甲|+2 死灵法师技能等级|+100-150 法力|减少物理伤害 7|+30 所有抗性"
        },
        {
            "name": "启迪",
            "name2": "Enlightenment",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                21,
                8,
                12
            ],
            "ll": 45,
            "desp": "5% 概率在击中目标时施放出15级火球|5% 概率当被击中时施放出15级炽烈之径|+2 法师技能等级|+1级 温暖|+30% 防御|减少物理伤害 7|+30% 抗火"
        },
        {
            "name": "神话",
            "name2": "Myth",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                15,
                11,
                4
            ],
            "ll": 25,
            "desp": "10% 概率在击中目标时施放出1级嘲弄|3% 概率当被击中时施放出1级狂嗥|+2 野蛮人技能等级|+10 生命恢复速度|-15% 装备需求|攻击者受到伤害 14|+30 对远程攻击防御"
        },
        {
            "name": "和平",
            "name2": "Peace",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                13,
                10,
                11
            ],
            "ll": 29,
            "desp": "2% 概率在击中目标时施放出15级女武神|4% 概率当被击中时施放出5级慢速箭|+2 亚马逊技能等级|+2 双倍打击|20% 快速打击恢复|+30% 抗寒|攻击者受到伤害 14"
        },
        {
            "name": "原则",
            "name2": "Principle",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                8,
                25,
                2
            ],
            "ll": 53,
            "desp": "100% 概率在击中目标时施放出5级圣光弹|+2 圣骑士技能等级|+100-150 生命|+50% 对不死系伤害|+30% 抗火|+5% 抗毒上限|耐力消耗减慢 15%"
        },
        {
            "name": "雨",
            "name2": "Rain",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                9,
                23,
                6
            ],
            "ll": 49,
            "desp": "5% 概率在击中目标时施放出15级小旋风|5% 概率当被击中时施放出5级飓风装甲|+2 德鲁依技能等级|+100-150 法力|+30% 防御|减少魔法伤害 7|15% 受损的生命转化成法力的提高"
        },
        {
            "name": "背信",
            "name2": "Treachery",
            "eqip": [
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                13,
                10,
                20
            ],
            "ll": 43,
            "desp": "25% 概率在击中目标时施放出15级毒牙|5% 概率当被击中时施放出15级 能量消解|+2 刺客技能等级|+45% 提升攻击速度|20% 快速打击恢复|+30% 抗寒|50% 额外金币从怪物身上取得"
        }
    ]

let rladder110 =
    [
        {
            "name": "烙印",
            "name2": "Brand",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                31,
                28,
                23,
                25
            ],
            "ll": 65,
            "desp": "35% 概率当被击中时施放出14级伤害加深|100% 概率在击中目标时施放出18级骨矛|射出爆裂箭矢|+260-340% 增强伤害|忽略目标防御|20% 提升攻击准确率|+280-330% 对恶魔的伤害|20% 概率出现致命打击|防止怪物自疗|击退"
        },
        {
            "name": "死神",
            "name2": "Death",
            "eqip": [
                "刀剑",
                "斧头"
            ],
            "slotnum": 5,
            "rns": [
                15,
                1,
                26,
                9,
                25
            ],
            "ll": 55,
            "desp": "100% 概率当你死亡时施放出44级连锁闪电|25% 概率在攻击时施放出18级冰尖柱|无法破坏|+300-385% 增强伤害|20% 提升攻击准确率|+50 攻击准确率|+1-50 电伤害|每次击中偷取 7% 法力|50% 概率出现压碎性打击|+0.5% 概率(每角色等级) 致命打击|+1 照亮范围|22级鲜血石魔 (15 次)|需求 -20%"
        },
        {
            "name": "毁灭",
            "name2": "Destruction",
            "eqip": [
                "长柄武器",
                "刀剑"
            ],
            "slotnum": 5,
            "rns": [
                26,
                28,
                30,
                31,
                18
            ],
            "ll": 65,
            "desp": "23% 概率在击中目标时施放出12级火山|5% 概率在击中目标时施放出23级熔浆巨岩|100% 概率当你死亡时施放出45级陨石|15% 概率在攻击时施放出22级新星|+350% 增强伤害|忽略目标防御|+100-180 魔法伤害|每次击中偷取 7% 法力|20% 概率出现压碎性打击|20% 概率出现致命打击|防止怪物自疗|+10 敏捷"
        },
        {
            "name": "飞龙",
            "name2": "Dragon",
            "eqip": [
                "盔甲",
                "盾牌"
            ],
            "slotnum": 3,
            "rns": [
                29,
                28,
                12
            ],
            "ll": 61,
            "desp": "20% 概率当被击中时施放出18级毒牙|12% 概率在击中目标时施放出15级九头火蛇|当装备后拥有14级圣火灵气|+360 防御|+230 对远程攻击的防御|+3-5 所有属性|+0.375 (每角色等级) 力量|提升法力上限 5% (盔甲) | +50 点法力 (盾牌)|+5% 抗闪电上限|物理伤害减少 7"
        },
        {
            "name": "梦境",
            "name2": "Dream",
            "eqip": [
                "头盔",
                "盾牌"
            ],
            "slotnum": 3,
            "rns": [
                16,
                31,
                21
            ],
            "ll": 65,
            "desp": "10% 概率当被击中时施放出15级迷乱|当装备后拥有15级神圣冲击灵气|+20-30% 快速打击恢复|+30% 增强防御|+150-220 防御|+10 体力|提升生命上限 5% (头盔) | +50 生命 (盾牌)|+0.625 (每角色等级) 法力|所有抗性 +5-20|15-25% 更佳的机会取得魔法装备"
        },
        {
            "name": "边缘",
            "name2": "Edge",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 3,
            "rns": [
                3,
                7,
                11
            ],
            "ll": 25,
            "desp": "当装备后拥有15级荆棘灵气|35% 提升攻击速度|+320-380% 对恶魔的伤害|+280% 对不死生物的伤害|+75 毒伤害，效果持续 5 秒|每次击中偷取 7% 生命|+5-10 所有属性|防止怪物自疗|+2 点法力在杀死每个敌人时获得|降低所有 NPC 价格 15%!!!"
        },
        {
            "name": "信心",
            "name2": "Faith",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                27,
                31,
                20,
                2
            ],
            "ll": 65,
            "desp": "当装备后拥有12-15级狂热灵气|+1-2 所有技能|+330% 增强伤害|忽略目标防御|300% 提升攻击准确率|+75% 对不死生物的伤害|+50 对抗不死生物的攻击准确率|+120 火伤害|所有抗性 +15|10% 概率将杀死的怪物复活为亡灵战士|75% 额外金币从怪物身上取得 "
        },
        {
            "name": "刚毅",
            "name2": "Fortitude",
            "eqip": [
                "武器",
                "盔甲"
            ],
            "slotnum": 4,
            "rns": [
                1,
                12,
                14,
                28
            ],
            "ll": 59,
            "desp": "<武器>|20% 概率当被击中时施放出15级寒冰装甲|+25% 快速施法速度|+300% 增强伤害|+200% 增强防御|+1-1.5 (每角色等级) 生命|+50 攻击准确率|击中时 25%概率吓跑怪物|+20% 概率出现致命打击|+9 最小伤害|所有抗性 +25-30|12% 受损的生命转化成法力的提高|+1 照亮范围||<盔甲>|20% 概率当被击中时施放出15级寒冰装甲|+25% 快速施法速度|+300% 增强伤害|+200% 增强防御|+1-1.5 (每角色等级) 生命|+15 防御|自动恢复生命速度 +7|+5% 抗闪电上限|物理伤害减少 7|所有抗性 +25-30|12% 受损的生命转化成法力的提高|+1 照亮范围"
        },
        {
            "name": "悔恨",
            "name2": "Grief",
            "eqip": [
                "刀剑",
                "斧头"
            ],
            "slotnum": 5,
            "rns": [
                5,
                3,
                28,
                23,
                8
            ],
            "ll": 59,
            "desp": "35% 概率在击中目标时施放出15级毒牙|30%-40% 提升攻击速度|伤害 +340-400|忽略目标防御|-25% 目标防御力|+1.875 (每角色等级)% 对恶魔的伤害|+5-30 火伤害|-20-25% 敌人的毒素系抗性|20% 概率出现致命打击|防止怪物自疗|+2 点法力在杀死每个敌人时获得|+11 点生命在杀死每个敌人时获得"
        },
        {
            "name": "和谐",
            "name2": "Harmony",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                3,
                6,
                12,
                18
            ],
            "ll": 39,
            "desp": "当装备后拥有10级活力灵气|+200-275% 增强伤害|+9 最小伤害|+9 最大伤害|+55-160 火伤害|+55-160 电伤害|+55-160 冰伤害|+2-6级女武神|+10 敏捷|提升法力恢复速度 20%|+2 点法力在杀死每个敌人时获得|+2 照亮范围|20级重生 (25 次)"
        },
        {
            "name": "冰冻",
            "name2": "Ice",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                11,
                13,
                31,
                28
            ],
            "ll": 65,
            "desp": "100% 概率当你升级时施放出40级暴风雪|25% 概率在击中目标时施放出22级霜之新星|当装备后拥有18级神圣冰冻灵气|20% 提升攻击速度|+140-210% 增强伤害|忽略目标防御|+25-30% 冰技能伤害|-20% 敌人的冰冷性抗性|每次击中偷取 7% 生命|20% 概率出现致命打击|+3.125 (每角色等级) 额外金币从怪物身上取得"
        },
        {
            "name": "无限",
            "name2": "Infinity",
            "eqip": [
                "长柄武器",
                "长矛"
            ],
            "slotnum": 4,
            "rns": [
                30,
                23,
                30,
                24
            ],
            "ll": 63,
            "desp": "50% 概率当你杀死敌人时施放出20级连锁闪电|当装备后拥有12级审判灵气|+35% 快速移动/奔跑|+255-325% 增强伤害|-(45-55)% 敌人的闪电系抗性|40% 概率出现压碎性打击|防止怪物自疗|+0.5 (每角色等级) 体力|30% 更佳的机会取得魔法装备|21级飓风装甲 (30 次)"
        },
        {
            "name": "洞察",
            "name2": "Insight",
            "eqip": [
                "长柄武器",
                "法杖",
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                8,
                3,
                7,
                12
            ],
            "ll": 27,
            "desp": "当装备后拥有12-17级冥想灵气|+35% 快速施法速度|+200-260% 增强伤害|+9 最小伤害|180-250% 提升攻击准确率|+5-30 火伤害|+75 毒伤害，效果持续 5 秒|+1-6级双倍打击|+5 所有属性|+2 点法力在杀死每个敌人时获得|提升 23% 魔法装备出现概率"
        },
        {
            "name": "最后希望",
            "name2": "Last Wish",
            "eqip": [
                "刀剑",
                "锤类",
                "斧头"
            ],
            "slotnum": 6,
            "rns": [
                31,
                23,
                31,
                29,
                31,
                30
            ],
            "ll": 65,
            "desp": "6% 概率当被击中时施放出11级能量消解|10% 概率在击中目标时施放出18级偷取生命|20% 概率在攻击时施放出20级充能弹|当装备后拥有17级力量灵气|+330-375% 增强伤害|忽略目标防御|60-70% 概率出现压碎性打击|防止怪物自疗|击中使目标目盲|0.5 (每角色等级)% 概率更佳的机会取得魔法装备"
        },
        {
            "name": "执法者",
            "name2": "Lawbringer",
            "eqip": [
                "刀剑",
                "锤类",
                "权杖"
            ],
            "slotnum": 3,
            "rns": [
                11,
                20,
                18
            ],
            "ll": 43,
            "desp": "20% 概率在击中目标时施放出15级衰老|当装备后拥有16-18级庇护所灵气|-50% 目标防御|+150-210 火伤害|+130-180 冰伤害|每次击中偷取 7% 生命|让怪物死后恢复平静|+200-250 对远程攻击的防御|+10 敏捷|75% 额外金币从怪物身上取得"
        },
        {
            "name": "誓约",
            "name2": "Oath",
            "eqip": [
                "刀剑",
                "斧头",
                "钉头锤"
            ],
            "slotnum": 4,
            "rns": [
                13,
                21,
                23,
                17
            ],
            "ll": 49,
            "desp": "30% 概率在击中目标时施放出20级白骨之魂|无法破坏|50% 提升攻击速度|+210-340% 增强伤害|+75% 对恶魔的伤害|+100 对抗恶魔的攻击准确率|防止怪物自疗|+10 能量|+10-15 魔法吸收|16级狼獾之心 (20 次)|17级钢铁石魔 (14 次)"
        },
        {
            "name": "遵从",
            "name2": "Obedience",
            "eqip": [
                "长柄武器",
                "长矛"
            ],
            "slotnum": 5,
            "rns": [
                15,
                18,
                10,
                5,
                19
            ],
            "ll": 41,
            "desp": "30% 概率当你杀死敌人时施放出21级火焰强化|40% 快速打击恢复|+370% 增强伤害|-25% 目标防御|+3-14 冰伤害|-25% 敌人的火焰系抗性|40% 概率出现压碎性打击|+200-300 防御|+10 力量|+10 敏捷|所有抗性 +20-30|需求 -20% "
        },
        {
            "name": "凤凰",
            "name2": "Phoenix",
            "eqip": [
                "武器",
                "盾牌"
            ],
            "slotnum": 4,
            "rns": [
                26,
                26,
                28,
                31
            ],
            "ll": 65,
            "desp": "<武器>|100% 概率当你升级时施放出40级烈焰之径|40% 概率在击中目标时施放出22级火风暴|当装备后拥有10-15级救赎灵气|+350-400% 增强伤害|-28% 敌人的火焰系抗性|+350-400 对远程攻击的防御|忽略目标防御|20% 概率出现致命打击|每次击中偷取 14% 法力|+15-21 火吸收||<盾牌>|100% 概率当你升级时施放出40级烈焰之径|40% 概率在击中目标时施放出22级火风暴|当装备后拥有10-15级救赎灵气|+350-400% 增强伤害|-28% 敌人的火焰系抗性|+350-400 对远程攻击的防御|+50 生命 |+5% 抗闪电上限|+10% 抗火上限|+15-21 火吸收"
        },
        {
            "name": "骄傲",
            "name2": "Pride",
            "eqip": [
                "长柄武器",
                "长矛"
            ],
            "slotnum": 4,
            "rns": [
                32,
                29,
                16,
                28
            ],
            "ll": 67,
            "desp": "25% 概率当被击中时施放出17级火墙|当装备后拥有16-20级专注灵气|260-300% 提升攻击准确率|+1% (每角色等级) 对恶魔的伤害|+ 50-280 电伤害|20% 概率出现致命打击|击中使目标目盲|冰冻目标 +3|+10 体力|自动恢复生命 +8|1.875 (每角色等级) 额外金币从怪物身上取得"
        },
        {
            "name": "裂缝",
            "name2": "Rift",
            "eqip": [
                "长柄武器",
                "权杖"
            ],
            "slotnum": 4,
            "rns": [
                15,
                18,
                20,
                25
            ],
            "ll": 53,
            "desp": "20% 概率在击中目标时施放出16级龙卷风|16% 概率在攻击时施放出21级冰封球|20% 提升攻击准确率|+160-250 魔法伤害|+60-180 火伤害|+5-10 所有属性|38% 受损的生命转化成法力的提高|75% 额外金币从怪物身上取得|15级攻击反噬 (40 次)|需求 -20% "
        },
        {
            "name": "精神",
            "name2": "Spirit",
            "eqip": [
                "刀剑",
                "盾牌"
            ],
            "slotnum": 4,
            "rns": [
                7,
                10,
                9,
                11
            ],
            "ll": 25,
            "desp": "<刀剑>|+2 所有技能|+25-35% 快速施法速度|+55% 快速打击恢复|+250 对远程攻击的防御|+22 体力|+89-112 法力|每次击中偷取 7% 生命|+3-14 冰伤害|+75 毒伤害，效果持续 5 秒|+1-50 电伤害|+3-8 魔法吸收||<盾牌>|+2 所有技能|+25-35% 快速施法速度|+55% 快速打击恢复|+250 对远程攻击的防御|+22 体力|+89-112 法力|攻击者受到伤害 14 |抗寒 +35%|抗毒 +35%|抗闪电 +35%|+3-8 魔法吸收"
        },
        {
            "name": "思考之声",
            "name2": "Voice of Reason",
            "eqip": [
                "刀剑",
                "钉头锤"
            ],
            "slotnum": 4,
            "rns": [
                20,
                18,
                1,
                2
            ],
            "ll": 43,
            "desp": "15% 概率在击中目标时施放出13级冰封球|18% 概率在击中目标时施放出20级冰风暴|+50 攻击准确率|+220-350% 对恶魔的伤害|+280-300% 对不死生物的伤害|+50 对抗不死生物的攻击准确率|+100-220 冰伤害|-24% 敌人抗寒|+10 敏捷|无法冰冻|75% 额外金币从怪物身上取得|+1 照亮范围"
        },
        {
            "name": "愤怒",
            "name2": "Wrath",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 4,
            "rns": [
                21,
                17,
                30,
                23
            ],
            "ll": 63,
            "desp": "30% 概率在击中目标时施放出1级衰老|5% 概率在击中目标时施放出10级偷取生命|+375% 对恶魔的伤害|+100 对抗恶魔的攻击准确率|+250-300% 对不死生物的伤害|+85-120 魔法伤害|+41-240 电伤害|20% 概率出现压碎性打击|防止怪物自疗|+10 能量|无法冰冻 "
        }
    ]

let r24 =
    [
        {
            "name": "瘟疫",
            "name2": "Plague",
            "eqip": [
                "刀剑",
                "爪类",
                "匕首"
            ],
            "slotnum": 3,
            "rns": [
                32,
                13,
                22
            ],
            "ll": 67,
            "desp": "20%概率当被击中时施放出12级降低抗性|25%概率在击中目标时施放出15级剧毒新星|在装备后拥有13-17级净化灵气|+1-2 所有技能|+20%提升攻击速度|+220-320%增强伤害|-23%敌人毒素抗性|+0.3% (0-29.7) 致命一击（在角色级别基础上）|25% 概率撕开敌人伤口|冰冻目标 +3"
        },
        {
            "name": "样式",
            "name2": "Pattern",
            "eqip": [
                "爪类"
            ],
            "slotnum": 3,
            "rns": [
                7,
                9,
                10
            ],
            "ll": 23,
            "desp": "+30%快速格挡|+40-80%增强伤害|+10%命中率加成|+17-62 火伤害|+3-14 冰伤害|+1-50 闪电伤害|+75 毒伤害，效果持续 5 秒|+6 力量|+6 敏捷|+15所有抗性"
        },
        {
            "name": "坚定意志",
            "name2": "Unbending Will",
            "eqip": [
                "刀剑"
            ],
            "slotnum": 6,
            "rns": [
                19,
                16,
                6,
                2,
                1,
                15
            ],
            "ll": 41,
            "desp": "18%概率在击中目标时施放出18级嘲讽|+3战斗技能（仅限野蛮人）|+20-30%攻速|+300-350%增强伤害|+9最大伤害|+50命中率（AR）|+75%对不死生物的伤害|+50对抗不死生物的攻击准确率|每击偷取8-10%生命|防止怪物治疗|+10力量|+10活力|伤害减少8|+1光照范围|需求 -20%"
        },
        {
            "name": "智慧",
            "name2": "Wisdom",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                21,
                6,
                2
            ],
            "ll": 45,
            "desp": "+33%穿刺攻击|+15-25%命中率|每击窃取4-8%法力值|+30%增强防御|+10能量|耐力消耗降低15%|无法冻结|+5点法力在杀死每个敌人时获得|15%受损的生命转化成法力的提高"
        },
        {
            "name": "着魔",
            "name2": "Obsession",
            "eqip": [
                "法杖"
            ],
            "slotnum": 6,
            "rns": [
                33,
                24,
                20,
                17,
                16,
                4
            ],
            "ll": 69,
            "desp": "无法破坏|24%概率当被击中时施放出10级削弱|+4所有技能|+65%施法速度|+60%快速打击恢复|击退|+10活力|+10能量|最大生命值增加15-25%|法力再生+15-30%|+60-70所有抗性|从怪物身上获得75%额外金币|30%更佳的机会取得魔法装备"
        },
        {
            "name": "摇曳火焰",
            "name2": "Flickering Flame",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                4,
                21,
                26
            ],
            "ll": 55,
            "desp": "当装备时拥有4-8级的抵抗火焰灵气|火系技能+3|-10-15%敌人的火焰系抗性|30%增强防御|对远程投射物+30防御|+50-75法力|+5%最大火焰抗性|冻结时间减半|中毒时间减少50%"
        },
        {
            "name": "迷雾",
            "name2": "Mist",
            "eqip": [
                "弓",
                "十字弓"
            ],
            "slotnum": 5,
            "rns": [
                32,
                13,
                25,
                10,
                6
            ],
            "ll": 67,
            "desp": "当装备时拥有8-12级专注灵气|+3所有技能|+20%提升攻击速度|+100%穿刺攻击|+325-375%增强伤害|+9最大伤害|+20%命中率加成|+3-14冰伤害|所有抗性 +40|冻结目标+3|+24 体力"
        }
    ]

let r26 =
    [
        {
            "name": "壁垒",
            "name2": "Bulwark",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                13,
                16,
                12
            ],
            "ll": 35,
            "desp": "20% 快速打击恢复|每次击中偷取 4-6% 生命|+75-100% 增强防御|+10 体力|提升生命上限 5%|自动恢复生命 +30|物理伤害减少 7|物理伤害减少 10-15%"
        },
        {
            "name": "解药",
            "name2": "Cure",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                13,
                16,
                7
            ],
            "ll": 35,
            "desp": "在装备后拥有1级净化灵气|20% 快速打击恢复|+75-100% 增强防御|+10 体力|提升生命上限 5%|抗毒 +40-60%|中毒时间减少50%"
        },
        {
            "name": "地面",
            "name2": "Ground",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                13,
                16,
                9
            ],
            "ll": 35,
            "desp": "20% 快速打击恢复|+75-100% 增强防御|+10 体力|提升生命上限 5%|抗闪电 +40-60%|闪电吸收 10-15% "
        },
        {
            "name": "壁炉",
            "name2": "Hearth",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                13,
                16,
                10
            ],
            "ll": 35,
            "desp": "20% 快速打击恢复|+75-100% 增强防御|+10 体力|提升生命上限 5%|抗寒 +40-60%|冰冷吸收10-15%|无法冻结"
        },
        {
            "name": "淬火",
            "name2": "Temper",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                13,
                16,
                8
            ],
            "ll": 35,
            "desp": "20% 快速打击恢复|+75-100% 增强防御|+10 体力|提升生命上限 5%|抗火 +40-60%|火焰吸收10-15%|"
        },
        {
            "name": "喧嚣",
            "name2": "Hustle",
            "eqip": [
                "武器",
                "盔甲"
            ],
            "slotnum": 3,
            "rns": [
                13,
                18,
                2
            ],
            "ll": 39,
            "desp": "<武器>|5% 概率在击中目标时施放出 1级速度爆发|在装备后拥有1级狂热灵气|30% 提升攻击速度|+180-200% 增强伤害|+75% 对不死生物的伤害|+50 对抗不死生物的攻击准确率|+10 敏捷||<盔甲>|65% 快速移动/奔跑|+40% 提升攻击速度|20% 快速打击恢复|+6 回避|+10 敏捷|耐力消耗减慢 50%|所有抗性 +10"
        },
        {
            "name": "模糊",
            "name2": "Mosaic",
            "eqip": [
                "爪类"
            ],
            "slotnum": 3,
            "rns": [
                23,
                25,
                11
            ],
            "ll": 53,
            "desp": "终结技不会消耗蓄能的机率提高50%，|以上述方式释放终结技时，|蓄能技能的持续时间也会被刷新。|+2武学艺术 (限刺客使用)|+20% 提升攻击速度|+200-250% 增强伤害|20% 提升攻击准确率|每次击中偷取 7% 生命|+8-15%冰冷技能伤害|+8-15%闪电技能伤害|+8-15%火焰技能伤害|防止怪物自疗"
        },
        {
            "name": "变形",
            "name2": "Metamorphosis",
            "eqip": [
                "头盔"
            ],
            "slotnum": 3,
            "rns": [
                16,
                32,
                19
            ],
            "ll": 67,
            "desp": "狼人变化攻击会赋予印记，持续 180 秒狼之印记|30% 提升攻击准确率|提升生命上限 40%|熊人变化攻击会赋予印记，持续 180 秒熊之印记|25% 提升攻击速度|物理伤害减少 20%|+5变形技能等级（限德鲁伊使用）|25% 概率出现压碎性打击|+50-80% 增强防御|+10 力量|+10 体力|所有抗性 +10|无法冻结"
        }
    ]

function generate(version, equipment, slotcount, rune, search) {
    rgeneral.forEach(r => r.ver = "general");
    r110.forEach(r => r.ver = "1.10");
    r111.forEach(r => r.ver = "1.11");
    rladder110.forEach(r => r.ver = "ladder1.10");
    r24.forEach(r => r.ver = "2.4");
    r26.forEach(r => r.ver = "2.6");
    
    var data;
    if (version == '1.*')
        data = rgeneral.concat(r110, r111);
    else if (version == 'ladder')
        data = rgeneral.concat(r110, r111, rladder110);
    else
        data = rgeneral.concat(r110, r111, rladder110, r24, r26);

    function matchEquipment(eqip)
    {
        var mace = ["锤类","钉头锤","铁锤"];
        var bodyArmor = ["近战武器"].concat(mace).concat(["棍棒","权杖","刀剑","法杖","斧头","手杖","爪类","匕首","长柄武器","长矛",]);
        var armor = bodyArmor.concat("武器","弓","十字弓");
        var shield = ["盾牌","圣骑士盾牌"];
    
        if(equipment == "武器")
            return armor.includes(eqip);
        else if(equipment == "近战武器")
            return bodyArmor.includes(eqip);
        else if(equipment == "盾牌")
            return shield.includes(eqip);
        else if(["头盔","盔甲","圣骑士盾牌"].includes(equipment))
            return equipment == eqip;
        else if(equipment == "锤类")
            return ["武器","近战武器"].concat(mace).includes(eqip);
        else if(mace.slice(1).includes(equipment))
            return ["武器","近战武器","锤类"].concat(equipment).includes(eqip);
        else if(bodyArmor.slice(1).includes(equipment))
            return ["武器","近战武器"].concat(equipment).includes(eqip);
        else //"弓","十字弓"
            return ["弓","十字弓","武器"].includes(eqip);
    }

    data = data.filter((en) =>
        (equipment ? en.eqip.find(matchEquipment) : true) &&
        (slotcount ? en.slotnum == slotcount : true) &&
        (rune ? en.rns.includes(parseInt(rune)) : true) &&
        (search ? en.name.match(search) || en.desp.match(search) : true)
    );

    var ul = document.getElementById("_index_");
    ul.innerHTML = null;

    var div = document.getElementById("_runewords_");
    div.innerHTML = null;

    function makeTag(e){
        return e.name2.replaceAll(" ","");
    }

    data.forEach(e => {
        var li = document.createElement("li");
        var a = document.createElement("a");
        a.href = "#" + makeTag(e);
        var span = document.createElement("span");
        span.className = "name"
        span.append(e.name);
        a.appendChild(span);
        a.appendChild(document.createElement("br"));
        span = document.createElement("span");
        span.className = "co";
        span.append(e.rns.join("+"));
        a.appendChild(span);
        li.appendChild(a);
        ul.appendChild(li);

        var container = document.createElement("div");
        container.className = "_runeword_";
        container.id = makeTag(e);
        div.appendChild(container);
        var inner = document.createElement("h3");
        inner.textContent = e.name;
        if(["ladder1.10","2.4","2.6"].includes(e.ver))
        {
            var t
            if(e.ver == "ladder1.10")
                t = "天梯1.10"
            else
                t = e.ver
            var vertext = document.createElement("span");
            vertext.className = "ver";
            vertext.append(t);
            inner.appendChild(document.createElement("br"));
            inner.appendChild(vertext);
        }
        container.appendChild(inner);
        inner = document.createElement("div");
        inner.textContent = e.slotnum + "凹槽 " + e.eqip.join('/');
        inner.className = "equipment";
        container.appendChild(inner);
        inner = document.createElement("div");
        inner.className = "runes";
        container.appendChild(inner);
        e.rns.forEach(r =>{
            var rune = document.createElement("div");
            rune.className = "rune";
            inner.appendChild(rune);
            var img = document.createElement("img");
            img.src = "img/" + r.toString().padStart(2, "0") + ".gif";
            var dr = runes.find(inr=>inr.no == r);
            img.alt = dr.name;
            rune.appendChild(img);
            rune.appendChild(document.createElement("br"));
            rune.append(dr.no + " " + dr.name);
        })
        inner = document.createElement("div");
        inner.className = "level";
        inner.append("角色等级需求:" + e.ll);
        container.appendChild(inner);
        inner = document.createElement("p");
        inner.innerHTML = e.desp.replaceAll(/<(.*?)>/g,"<span>$1</span>").replaceAll("|", "<br>");
        container.appendChild(inner);
    });
}